Revit 2024 API
DocumentSavedAsEventArgs.OriginalPath Property
 Original path of the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public string OriginalPath { get; }
Visual Basic
Public ReadOnly Property OriginalPath As String
	Get
Visual C++
public:
property String^ OriginalPath {
	String^ get ();
}
See Also
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace